backend/app/services/tasks/update_service.rb

INSERT INTO "tasks" ("category_id", "completed", "created_at", "description", "due_date", "estimated_minutes", "parent_id", "position", "priority", "status", "title", "updated_at") VALUES (NULL, FALSE, '2026-02-04 19:18:00.144313', '', NULL, NULL, NULL, 0, 0, 0, 'call family', '2026-02-04 19:18:00.144313') RETURNING "id"
UPDATE "tasks" SET "updated_at" = '2026-02-04 19:14:10.194508', "status" = 2 WHERE "tasks"."id" = 1
---
    def call(task_params:, tag_ids: nil)
      Task.transaction do
        @task.assign_attributes(task_params)

        unless @task.save