backend/app/services/task_stats_service.rb

  def category_breakdown
    @tasks.joins(:category)
          .group("categories.id")
          .count("tasks.id")
---
SELECT COUNT("tasks"."id") AS "count_tasks_id", "categories"."id" AS "categories_id" FROM "tasks" INNER JOIN "categories" ON "categories"."id" = "tasks"."category_id" GROUP BY "categories"."id"