backend/app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def index
    @categories = Category.all.order(:name)

INSERT INTO "categories" ("color", "created_at", "icon", "name", "updated_at") VALUES ('#3B82F6', '2026-02-04 19:17:48.811944', '🏠', 'family', '2026-02-04 19:17:48.811944') RETURNING "id"
---
  def create
    @category = Category.new(category_params)

    if @category.save