backend/app/controllers/api/v1/tags_controller.rb

SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC
---
  def index
    @tags = Tag.all.order(:name)

INSERT INTO "tags" ("color", "created_at", "name", "updated_at") VALUES ('#3B82F6', '2026-02-04 19:18:38.759676', 'dead', '2026-02-04 19:18:38.759676') RETURNING "id"
---
  def create
    @tag = Tag.new(tag_params)

    if @tag.save