backend/app/controllers/api/v1/tasks_controller.rb

  def index
    @tasks = Task.top_level
                 .by_status(params[:status])
                 .by_priority(params[:priority])
                 .by_category(params[:category_id])
                 .due_before(params[:due_before])
                 .due_after(params[:due_after])
                 .search(params[:search])

    # Filter by tags if provided
    if params[:tag_ids].present?
      @tasks = @tasks.joins(:tags).where(tags: { id: params[:tag_ids] }).distinct
    end

    # Sorting
    sort_by = %w[created_at due_date priority position title].include?(params[:sort_by]) ? params[:sort_by] : "created_at"
    sort_order = params[:sort_order] == "asc" ? :asc : :desc
    @tasks = @tasks.order(sort_by => sort_order)

    # Pagination
    page = (params[:page] || 1).to_i
    per_page = params[:per_page].present? ? [[params[:per_page].to_i, 1].max, 100].min : 20
    total_count = @tasks.count
    @tasks = @tasks.offset((page - 1) * per_page).limit(per_page)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "tags".* FROM "tags" INNER JOIN "task_tags" ON "tags"."id" = "task_tags"."tag_id" WHERE "task_tags"."task_id" = 4
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."parent_id" IS NULL AND "tasks"."status" = 0 AND "tasks"."priority" = 1
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."parent_id" IS NULL AND "tasks"."status" = 1 AND "tasks"."priority" = 0
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "task_tags" ON "tags"."id" = "task_tags"."tag_id" WHERE "task_tags"."task_id" = 6

  def stats
    tasks = Task.all
    completed_tasks = tasks.where(status: :completed)

    render json: {
      total: tasks.count,
      pending: tasks.where(status: :pending).count,
      in_progress: tasks.where(status: :in_progress).count,
      completed: completed_tasks.count,
      archived: tasks.where(status: :archived).count,
      by_priority: {
        low: tasks.where(priority: :low).count,
        medium: tasks.where(priority: :medium).count,
        high: tasks.where(priority: :high).count,
        urgent: tasks.where(priority: :urgent).count
      },
      by_status: {
        pending: tasks.where(status: :pending).count,
        in_progress: tasks.where(status: :in_progress).count,
        completed: completed_tasks.count,
        archived: tasks.where(status: :archived).count
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."status" = 3
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."priority" = 3

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at", "priority", "status", "due_date", "category_id", "position", "estimated_minutes", "parent_id") VALUES ('Book a flight', '', FALSE, '2026-01-23 01:13:31.515166', '2026-01-23 01:13:31.515166', 0, 0, NULL, NULL, 0, NULL, NULL) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "completed" = TRUE, "updated_at" = '2026-01-25 07:55:20.622571', "status" = 2 WHERE "tasks"."id" = 5

  def bulk_update
    task_ids = params[:task_ids]
    updates = params[:updates]&.permit(:status, :priority, :category_id, :due_date)

    return render json: { error: "task_ids required" }, status: :bad_request if task_ids.blank?
    return render json: { error: "updates required" }, status: :bad_request if updates.blank?

    tasks = Task.where(id: task_ids)
    updated_count = tasks.update_all(updates.to_h)
---
UPDATE "tasks" SET "status" = ? WHERE "tasks"."id" IN (?, ?)  [["status", 2], ["id", 1], ["id", 2]]

  def bulk_delete
    task_ids = params[:task_ids]

    return render json: { error: "task_ids required" }, status: :bad_request if task_ids.blank?

    deleted_count = Task.where(id: task_ids).destroy_all.count
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def reorder
    positions = params[:positions] # Array of { id: number, position: number }

    return render json: { error: "positions required" }, status: :bad_request if positions.blank?

    Task.transaction do
      positions.each do |item|
        Task.where(id: item[:id]).update_all(position: item[:position])
---
UPDATE "tasks" SET "position" = ? WHERE "tasks"."id" = ?  [["position", 2], ["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1